gordonthree/can-stm32f103-remote/src/main.cpp
  memcpy(buf + n1, arr2, n2 * sizeof(uint8_t)); // copy the second array to the buffer

  return buf; // that's all folks return complete array
}

// send an introduction message to the bus
// static void txIntroduction(const uint8_t* txNodeID, const uint8_t* txNodeFeatureMask, const uint_8t txMsgData, const uint16_t txmsgID, const uint8_t ptr) {
/**
 * @brief Introduce this node and modules to the entire net
 * 
 * @param ptr optional pointer for where we are in the introductions. leave blank to only send the node intro message
 */
static void txIntroduction(int ptr = -1) {
  0;

  if ( ptr <= 0) {  // step one introduce the node itself, then move onto modules
    uint16_t txMsgID = nodeInfo.nodeType;
    Serial.printf("TX: NODE INTRO PTR %i MSG: %03x\n", ptr, txMsgID);  // tell the user some things
    // uint8_t n1 = sizeof(nodeInfo.nodeID) / sizeof(nodeInfo.nodeID[0]);
    // uint8_t n2 = sizeof(nodeInfo.featureMask) / sizeof(nodeInfo.featureMask[0]);

    uint8_t* dataBytes = messageBuilder(nodeInfo.nodeID, nodeIdArrSize, nodeInfo.featureMask, featureMaskArrSize);

    send_message(nodeInfo.nodeType, dataBytes, sizeof(dataBytes));  // send this data to the tx queue
  }
  


  if (ptr > 0) {                                              // remaining steps
    uint8_t modPtr = (ptr - 1);
    uint16_t txMsgID = nodeInfo.subModules[modPtr].modType;  // retrieve module type, reduce pointer by 1 so we start at beginning of submodules

    if (txMsgID > 0) {                                        // make sure a module is defined
      uint16_t txMsgID = nodeInfo.subModules[modPtr].modType;
      
      if (nodeInfo.subModules[modPtr].sendFeatureMask) {     // this module requires the feature mask to be sent with the introduction
        uint8_t* dataBytes = messageBuilder(nodeInfo.nodeID, nodeIdArrSize, nodeInfo.subModules[ptr].featureMask, featureMaskArrSize);
        send_message(txMsgID, dataBytes, sizeof(dataBytes));  // send this data to the tx queue
      }
    }
    uint8_t dataBytes[6] = { txNodeID[0], txNodeID[1], txNodeID[2], txNodeID[3], 
                              txNodeFeatureMask[0], txNodeFeatureMask[1] }; 

    send_message(txmsgID, dataBytes, 6);
  } else {
    uint8_t dataBytes[5] = { txNodeID[0], txNodeID[1], txNodeID[2], txNodeID[3], txMsgData }; 

    send_message(txmsgID, dataBytes, 5);
  }
}

static void nodeCheckStatus() {
  if (FLAG_SEND_INTRODUCTION) {
    // send introduction message to all nodes
    txIntroduction((uint8_t*)nodeInfo.nodeID, (uint8_t*)nodeInfo.featureMask, introMsgData[introMsgPtr], introMsg[introMsgPtr], introMsgPtr);
    Serial.printf("TX: INTRO MSG %d OF %d\n", introMsgPtr, introMsgCnt);

    if (introMsgPtr >= introMsgCnt) {
      FLAG_SEND_INTRODUCTION = false; // clear flag to send introduction message
      FLAG_BEGIN_NORMAL_OPER = true; // set flag to begin normal operation 
    }
  }

  if (!FLAG_BEGIN_NORMAL_OPER) {
    return; // normal operation not started, exit function
  }

  for (uint8_t switchID = 0; switchID < mySwitchCount; switchID++) {
    uint8_t swState = nodeSwitch[switchID].swState; // get switch state
    uint8_t swMode = nodeSwitch[switchID].swMode; // get switch mode
    uint8_t stateData[] = {myNodeID[0], myNodeID[1], myNodeID[2], myNodeID[3], switchID}; // send my own node ID, along with the switch number
    uint8_t modeData[] = {myNodeID[0], myNodeID[1], myNodeID[2], myNodeID[3], switchID, swMode}; // send my own node ID, along with the switch number
      
    // send_message(DATA_OUTPUT_SWITCH_MODE, modeData, sizeof(modeData));  
    // Serial.printf("TX: DATA: Switch %d State %d Mode %d\n", switchID, swState, swMode);

    switch (swState) {
      case 0: // switch off
        send_message(DATA_OUTPUT_SWITCH_OFF, stateData, sizeof(stateData));
        break;
      case 1: // switch on
        send_message(DATA_OUTPUT_SWITCH_ON, stateData, sizeof(stateData));
        break;
      case 2: // momentary press
        send_message(DATA_OUTPUT_SWITCH_MOM_PUSH, stateData, sizeof(stateData));
        break;
      default:
        break;
    }
  }

  for (uint8_t sensorID = 0; sensorID < MAX_SENSOR_CNT; sensorID++) { // loop through sensors 
    if (nodeSensor[sensorID].present) {                               // only send data for sensors that are present
      uint16_t privMsg = nodeSensor[sensorID].sensorMsg;          
      if (privMsg != 0) {                                             // use private channel assigned to send the data
        char buf[CAN_MAX_DLC] = {0};          
        sprintf(buf, "%d", nodeSensor[sensorID].i32Value);            // convert signed integer to string
        send_message(privMsg, (uint8_t*) buf, CAN_MAX_DLC);           // send message with ID assigned by controller
      } else {
        char buf[CAN_MAX_DLC] = {0};
        strcat(buf, (char*)myNodeID);                                  // copy my node id to the buffer first
        strcat(buf, (char*)chunk32(nodeSensor[sensorID].i32Value));    // now copy the sensor data


      }
    }
  }
 
}

static void handle_rx_message(CAN_message_t &message) {
  bool msgFlag = false;
  bool haveRXID = false; 
  int msgIDComp;
  uint16_t msgID = message.id;
  uint8_t rxNodeID[NODE_ID_SIZE] = {0, 0, 0, 0}; // node ID

  digitalWrite(LED_BUILTIN, LED_ON);

 
  // WebSerial.printf("RX: MSG: %03x DATA: %u\n", message.id, message.len);

  // check if message contains enough data to have node id
  if (message.len >= NODE_ID_SIZE) { 
    memcpy((void *)rxNodeID, (const void *)message.buf, 4); // copy node id from message
    msgIDComp = memcmp((const void *)rxNodeID, (const void *)myNodeID, 4);
    haveRXID = true; // set flag to true if message contains node id

    if (msgIDComp == 0) { // message is for us
      msgFlag = true; // message is for us, set flag to true
    }
  }

  // if ((!msgFlag) && (message.id <= 0x17F)) { // switch control message but not for us
  //   return; // exit function
  // } 

  switch (msgID) {
    case MSG_NORM_OPER: // normal operation message
      Serial.printf("RX: Normal Operation Message\n");
      FLAG_BEGIN_NORMAL_OPER = true; // set flag to begin normal operation
      // introMsgPtr = introMsgPtr + 1; // increment intro message pointer 4th step
      break;
    case MSG_HALT_OPER: // halt operation message
      Serial.printf("RX: Halt Operation Message\n");
      // introMsgPtr = 0; // reset intro message pointer
      FLAG_BEGIN_NORMAL_OPER = false; // clear flag to halt normal operation
      break;
    case SW_SET_OFF:            // set output switch off
      rxSwitchState(message.buf, 0);
      break;
    case SW_SET_ON:             // set output switch on
      rxSwitchState(message.buf, 1);
      break;
    case SW_MOM_PRESS:          // set output momentary
      rxSwitchState(message.buf, 2);
      break;
    case SW_SET_MODE:           // setup output switch modes
      rxSwitchMode(message.buf);
      break;
    case SW_SET_PWM_DUTY:          // set output switch pwm duty
      rxPWMDuty(message.buf);  
      break;
    case SW_SET_PWM_FREQ:          // set output switch pwm frequency
      rxPWMFreq(message.buf);
      break;
    case SW_SET_MOM_DUR:          // set output switch momentary duration
      rxSwMomDur(message.buf);
      break;
    case SW_SET_BLINK_DELAY:          // set output switch blink delay
      rxSwBlinkDelay(message.buf);
      break;
    case SW_SET_STROBE_PAT:          // set output switch strobe pattern
      rxSwStrobePat(message.buf);
      break;


    case REQ_NODE_INTRO: // request for box introduction, kicks off the introduction sequence
      if (haveRXID) { // check if REQ message contains node id
        // Serial.printf("RX: REQ NODE responding to %02x:%02x:%02x:%02x\n", rxNodeID[0], rxNodeID[1], rxNodeID[2], rxNodeID[3]);
        introMsgPtr = 0; // reset intro message pointer
        FLAG_SEND_INTRODUCTION = true; // set flag to send introduction message
      }
      break;

    case ACK_INTRO:
      if (msgFlag) { // message was sent to our ID
        if (introMsgPtr < introMsgCnt) {
          Serial.printf("RX: INTRO ACK %d\n", introMsgPtr);  
          FLAG_SEND_INTRODUCTION = true; // keep sending introductions until all messages have been acknowledged
          introMsgPtr = introMsgPtr + 1; // increment intro message pointer 1st step
        }
      }
      break;
    

      default:
        if (msgID == DATA_EPOCH) {
          uint8_t epochBytes[4] = {message.buf[0], message.buf[1], message.buf[2], message.buf[3]};
          uint32_t rxTime = 0;
          rxTime = unchunk32(epochBytes);
    
          Serial.printf("RX: EPOCH TIME %u\n", rxTime);
        }

        if (message.len > 0) { // message contains data, check if it is for us
          if (msgFlag) {
            // Serial.printf("RX: MATCH MSG: %03x DATA: %u\n", message.id, message.len);
          } else {
            Serial.printf("RX: NO MATCH MSG: %03x DATA: u%\n", message.id, message.len);
          }
        } else {
          if (msgFlag) {
            // Serial.printf("RX: MATCH MSG: %03x NO DATA\n", message.id);
          } else {
            Serial.printf("RX: NO MATCH MSG: %03x NO DATA\n", message.id);
          } 
        }
      
      
      break;
  }
  
  digitalWrite(LED_BUILTIN, LED_OFF);
  
} // end of handle_rx_message

  
static void loadJSONConfig() {/* 
  Serial.println("Starting JSON Parsing...");

  // Allocate the JsonDocument (use https://arduinojson.org/v6/assistant/ for sizing)
  // StaticJsonDocument doc; // Increased buffer slightly from recommendation

  // Deserialize the JSON input
  DeserializationError error = deserializeJson(doc, jsonInput);

  // Check for parsing errors
  if (error) {
    Serial.print("deserializeJson() failed: ");
    Serial.println(error.c_str());
    return; // Don't continue if parsing failed
  }

